package buu.informatics59160953.drivingtest.screens.examguidelines

import androidx.lifecycle.ViewModel

class ExamGuidelinesViewModel:ViewModel() {
    val items = listOf(MyData("รถต่อไปนี้ได้รับการยกเว้นไม่ต้องจดทะเบียน?","ตอบ  รถที่เจ้าของรถแจ้งการไม่ใช้รถ"),
        MyData("ข้อใดไม่ใช่การตรวจสอบน้ำมัน?","ตอบ  ดมกลิ่น"),
        MyData("แบตเตอรี่รถยนต์จะมีขนาดแรงดันไฟฟ้ากี่โวลท์?","ตอบ  12 โวลท์"),
        MyData("หากประสงค์จะย้ายรถ เจ้าของรถต้องแจ้งย้ายรถต่อนายทะเบียนภายในกี่วัน?","ตอบ  15 วัน"),
        MyData("น้ำที่ใช้เติมแบตเตอรี่ ควรใช้น้ำชนิดใด?","ตอบ  น้ำกลั่น"),
        MyData("การถอดขั้วแบเตอรี่ ควรถอดขั้วใดก่อน?","ตอบ  ขั้วลบ"),
        MyData("ถ้าเติมลมยางอ่อนเกกินไป จะมีผลอย่างไรกับยาง?","ตอบ  ทำให้ดอกยางทางด้านข้างทั้งสองสึกหรอ"),
        MyData("สภาพท่อยางหม้อน้ำที่ยังใช้งานได้ดีต้องมีลักษณะอย่างไร?","ตอบ  บีบแล้วต้องมีความยืดหยุ่น"),
        MyData("รถที่ไม่เสียภาษีประจำปีภายในกำหนดจะต้องเสียเงินเพิ่มเท่าใด?","ตอบ  ร้อยละ 1 ต่อเดือน"),
        MyData("รถจักรยานยนต์ที่มีอายุครบปีต้องนำไปตรวจสภาพรถก่อนเสียภาษีประจำปี?","ตอบ  5 ปี")
    )
}