package buu.informatics59160953.drivingtest.screens.examguidelines

import androidx.lifecycle.ViewModel

class ExamGuidelinesViewModel:ViewModel() {
    val items = listOf(MyData("1. รถต่อไปนี้ได้รับการยกเว้นไม่ต้องจดทะเบียน?","ตอบ  รถที่เจ้าของรถแจ้งการไม่ใช้รถ"),
        MyData("2. แบตเตอรี่รถยนต์จะมีขนาดแรงดันไฟฟ้ากี่โวลท์?","ตอบ  12 โวลท์"),
        MyData("3. หากประสงค์จะย้ายรถ เจ้าของรถต้องแจ้งย้ายรถต่อนายทะเบียนภายในกี่วัน?","ตอบ  15 วัน"),
        MyData("4. น้ำที่ใช้เติมแบตเตอรี่ ควรใช้น้ำชนิดใด?","ตอบ  น้ำกลั่น"),
        MyData("5. การถอดขั้วแบตเตอรี่ ควรถอดขั้วใดก่อน?","ตอบ  ขั้วลบ"),
        MyData("6. ถ้าเติมลมยางอ่อนเกินไป จะมีผลอย่างไรกับยาง?","ตอบ  ทำให้ดอกยางทางด้านข้างทั้งสองสึกหรอ"),
        MyData("7. สภาพท่อยางหม้อน้ำที่ยังใช้งานได้ดีต้องมีลักษณะอย่างไร?","ตอบ  บีบแล้วต้องมีความยืดหยุ่น"),
        MyData("8. รถที่ไม่เสียภาษีประจำปีภายในกำหนดจะต้องเสียเงินเพิ่มเท่าใด?","ตอบ  ร้อยละ 1 ต่อเดือน"),
        MyData("9. รถจักรยานยนต์ที่มีอายุครบปีต้องนำไปตรวจสภาพรถก่อนเสียภาษีประจำปี?","ตอบ  5 ปี"),
        MyData("10. ข้อใดไม่ใช่การตรวจสอบน้ำมัน?","ตอบ  ดมกลิ่น")
    )
}